tut3/tut3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-17 Mi 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Praktikum Hashell – Tutorium 3 (2017-05-16)</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Praktikum Hashell – Tutorium 3 (2017-05-16)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3ba715b">1. Aufgabe 1 (Folie III/2)</a></li>
<li><a href="#org462609f">2. Aufgabe 2 (Folie III/5)</a></li>
<li><a href="#orgcc386da">3. Aufgabe 3 (Folie III/10)</a></li>
<li><a href="#orgc3e29e3">4. Aufgabe 4 (Folie III/14)</a></li>
<li><a href="#orgb0b5b0e">5. Aufgabe 5 (Folie III/24)</a></li>
<li><a href="#orga928023">6. Aufgabe 6 (TCP, Exercise 5.2)</a></li>
<li><a href="#orgb89dbd7">7. Aufgabe 7 (TCP, Exercise 5.3)</a></li>
<li><a href="#orga700d58">8. Leseauftrag</a></li>
<li><a href="#org5dfbac4">9. Literatur</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3ba715b" class="outline-2">
<h2 id="org3ba715b"><span class="section-number-2">1</span> Aufgabe 1 (Folie III/2)</h2>
<div class="outline-text-2" id="text-1">
<p>
Laden Sie sich die Vorlagen von der Webseite herunter.
Programmieren Sie dann die Funktion <code>greatgrandmotherfs</code>, welche
für eine gegebene Person mit Hilfe der Funktionen mother und
father die Urgroßmutter (groß)väterlicherseits berechnet. Ist die
Urgroßmutter nicht bekannt, soll Nothing zurückgegeben werden,
ansonsten Just p, wobei p die Urgroßmutter ist.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">Genealogy</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">String</span>

<span style="color: #268bd2;">father</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Maybe</span> <span style="color: #b58900;">Person</span>
<span style="color: #268bd2;">father</span> <span style="color: #2aa198;">"Albert"</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Berti"</span>
<span style="color: #268bd2;">father</span> <span style="color: #2aa198;">"Berti"</span>  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Conrad"</span>
<span style="color: #268bd2;">father</span> <span style="color: #2aa198;">"Beate"</span>  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Dennis"</span>
<span style="color: #268bd2;">father</span> <span style="color: #2aa198;">"Conrad"</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Erich"</span>
<span style="color: #268bd2;">father</span> <span style="color: #2aa198;">"Eva"</span>    <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Fritz"</span>
<span style="color: #268bd2;">father</span> <span style="color: #859900; font-weight: bold;">_</span>        <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Nothing</span>

<span style="color: #268bd2;">mother</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Maybe</span> <span style="color: #b58900;">Person</span>
<span style="color: #268bd2;">mother</span> <span style="color: #2aa198;">"Albert"</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Beate"</span>
<span style="color: #268bd2;">mother</span> <span style="color: #2aa198;">"Berti"</span>  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Claudia"</span>
<span style="color: #268bd2;">mother</span> <span style="color: #2aa198;">"Beate"</span>  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Dora"</span>
<span style="color: #268bd2;">mother</span> <span style="color: #2aa198;">"Conrad"</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Just</span> <span style="color: #2aa198;">"Eva"</span>
<span style="color: #268bd2;">mother</span> <span style="color: #859900; font-weight: bold;">_</span>        <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Nothing</span>

<span style="color: #268bd2;">parents</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">Person</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">parents</span> p <span style="color: #268bd2;">=</span> maybeToList <span style="color: #2aa198;">(</span>father p<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">++</span> maybeToList <span style="color: #2aa198;">(</span>mother p<span style="color: #2aa198;">)</span>
  <span style="color: #859900; font-weight: bold;">where</span>
    maybeToList <span style="color: #b58900;">Nothing</span>  <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[]</span>
    maybeToList <span style="color: #2aa198;">(</span><span style="color: #b58900;">Just</span> a<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">greatgrandmotherfs</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Maybe</span> <span style="color: #b58900;">Person</span>
<span style="color: #268bd2;">greatgrandmotherfs</span> <span style="color: #268bd2;">=</span> undefined
</pre>
</div>
</div>
</div>

<div id="outline-container-org462609f" class="outline-2">
<h2 id="org462609f"><span class="section-number-2">2</span> Aufgabe 2 (Folie III/5)</h2>
<div class="outline-text-2" id="text-2">
<p>
Laden Sie sich die Vorlagen von der Webseite herunter.
Programmieren Sie dann die Funktion <code>greatgrandparents</code>, welche
für eine gegebene Person mit Hilfe der Funktion parents alle
bekannten Urgroßeltern berechnet und in einer Liste zurück gibt.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">greatgrandparents</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Person</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">Person</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">greatgrandparents</span> <span style="color: #268bd2;">=</span> undefined
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc386da" class="outline-2">
<h2 id="orgcc386da"><span class="section-number-2">3</span> Aufgabe 3 (Folie III/10)</h2>
<div class="outline-text-2" id="text-3">
<p>
Schreiben Sie die Funktion <code>powerM</code>, sodass <code>powerM m n</code> eine
monadische Berechnung <code>m</code> genau <code>n</code>-mal hintereinander
ausführt, z. B. <code>powerM m 3 = \ x -&gt; m x &gt;&gt;= m &gt;&gt;= m</code>.
Welchen Typ hat <code>powerM</code>?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">powerM1</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Monad</span> m <span style="color: #268bd2;">=&gt;</span> <span style="color: #2aa198;">(</span>a <span style="color: #268bd2;">-&gt;</span> m a<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> a <span style="color: #268bd2;">-&gt;</span> m a
<span style="color: #268bd2;">powerM1</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #6c71c4;">0</span> <span style="color: #268bd2;">=</span> return
<span style="color: #268bd2;">powerM1</span> m n <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span>x <span style="color: #268bd2;">-&gt;</span> m x <span style="color: #268bd2;">&gt;&gt;=</span> powerM1 m <span style="color: #2aa198;">(</span>n <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">1</span><span style="color: #2aa198;">)</span>

<span style="color: #268bd2;">powerM2</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Monad</span> m <span style="color: #268bd2;">=&gt;</span> <span style="color: #2aa198;">(</span>a <span style="color: #268bd2;">-&gt;</span> m a<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> a <span style="color: #268bd2;">-&gt;</span> m a
<span style="color: #268bd2;">powerM2</span> m <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">(</span>iterate <span style="color: #b58900;">(</span>m <span style="color: #268bd2;">&lt;=&lt;</span><span style="color: #b58900;">)</span> return <span style="color: #268bd2;">!!</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Bestimmen Sie mit Hilfe von <code>powerM</code> für eine Person den
Urgroßvater (groß)väterlicherseits und alle Urgroßeltern.
</p>
</div>
</div>

<div id="outline-container-orgc3e29e3" class="outline-2">
<h2 id="orgc3e29e3"><span class="section-number-2">4</span> Aufgabe 4 (Folie III/14)</h2>
<div class="outline-text-2" id="text-4">
<p>
Definieren Sie einen Wert, der alle primitiven pythagoreischen
Tripel in einer Liste repräsentiert. Genauer: Für jedes primitive
pythagoreische Tripel soll es genau ein n ∈ N geben, sodass das n-te
Element der Liste gleich dem Tripel ist. Schreiben Sie jeweils eine
Variante
</p>
<ul class="org-ul">
<li>mittels Listen-Monade ohne do-Ausdrücke,</li>
<li>mittels Listen-Monade ohne Bind-Operator und</li>
<li>mittels List-Comprehension.</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">pythagoreanTriples1</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">pythagoreanTriples1</span> <span style="color: #268bd2;">=</span> <span style="color: #859900; font-weight: bold;">do</span>
  u <span style="color: #268bd2;">&lt;-</span> <span style="color: #2aa198;">[</span><span style="color: #6c71c4;">2</span> <span style="color: #268bd2;">..</span><span style="color: #2aa198;">]</span>
  v <span style="color: #268bd2;">&lt;-</span> <span style="color: #2aa198;">[</span>u <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">1</span>, u <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">3</span> <span style="color: #268bd2;">..</span> <span style="color: #6c71c4;">1</span><span style="color: #2aa198;">]</span>
  <span style="color: #859900; font-weight: bold;">if</span> gcd u v <span style="color: #268bd2;">==</span> <span style="color: #6c71c4;">1</span>
  <span style="color: #859900; font-weight: bold;">then</span> return <span style="color: #2aa198;">(</span>u <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">-</span> v <span style="color: #268bd2;">*</span> v, <span style="color: #6c71c4;">2</span> <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">*</span> v, u <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">+</span> v <span style="color: #268bd2;">*</span> v<span style="color: #2aa198;">)</span>
  <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #2aa198;">[]</span>

<span style="color: #268bd2;">pythagoreanTriples2</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">pythagoreanTriples2</span>
  <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[</span> <span style="color: #b58900;">(</span>u <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">-</span> v <span style="color: #268bd2;">*</span> v, <span style="color: #6c71c4;">2</span> <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">*</span> v, u <span style="color: #268bd2;">*</span> u <span style="color: #268bd2;">+</span> v <span style="color: #268bd2;">*</span> v<span style="color: #b58900;">)</span>
    <span style="color: #268bd2;">|</span> u <span style="color: #268bd2;">&lt;-</span> <span style="color: #b58900;">[</span><span style="color: #6c71c4;">2</span> <span style="color: #268bd2;">..</span><span style="color: #b58900;">]</span>
    , v <span style="color: #268bd2;">&lt;-</span> <span style="color: #b58900;">[</span>u <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">1</span>, u <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">3</span> <span style="color: #268bd2;">..</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span>
    , gcd u v <span style="color: #268bd2;">==</span> <span style="color: #6c71c4;">1</span>
    <span style="color: #2aa198;">]</span>

<span style="color: #268bd2;">pythagoreanTriplesNaive</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span>, <span style="color: #b58900;">Integer</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">pythagoreanTriplesNaive</span>
  <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[</span> <span style="color: #b58900;">(</span>a, b, c<span style="color: #b58900;">)</span>
    <span style="color: #268bd2;">|</span> c <span style="color: #268bd2;">&lt;-</span> <span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span> <span style="color: #268bd2;">..</span><span style="color: #b58900;">]</span>
    , a <span style="color: #268bd2;">&lt;-</span> <span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span> <span style="color: #268bd2;">..</span> c<span style="color: #b58900;">]</span>
    , b <span style="color: #268bd2;">&lt;-</span> <span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span> <span style="color: #268bd2;">..</span> c<span style="color: #b58900;">]</span>
    , a <span style="color: #268bd2;">*</span> a <span style="color: #268bd2;">+</span> b <span style="color: #268bd2;">*</span> b <span style="color: #268bd2;">==</span> c <span style="color: #268bd2;">*</span> c
    , gcd a <span style="color: #b58900;">(</span>gcd b c<span style="color: #b58900;">)</span> <span style="color: #268bd2;">==</span> <span style="color: #6c71c4;">1</span>
    <span style="color: #2aa198;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0b5b0e" class="outline-2">
<h2 id="orgb0b5b0e"><span class="section-number-2">5</span> Aufgabe 5 (Folie III/24)</h2>
<div class="outline-text-2" id="text-5">
<p>
Implementieren Sie intify mit Hilfe der State-Monade. Nutzen Sie
dazu eines der Module
</p>
<ul class="org-ul">
<li>Control.Monad.State.Lazy oder</li>
<li>Control.Monad.State.Strict.</li>
</ul>
<p>
Welches der beiden Module ist besser geeignet? Besteht Ihre
Implementierung alle Tests? Wenn nicht, warum?
</p>

<p>
<b>Erinnerung</b>
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">intify</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">Tree</span> a<span style="color: #2aa198;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">[</span><span style="color: #b58900;">Tree</span> <span style="color: #b58900;">Int</span><span style="color: #b58900;">]</span>, <span style="color: #b58900;">[</span><span style="color: #268bd2;">(</span>a, <span style="color: #b58900;">Int</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>
</pre>
</div>
<p>
Die Funktion soll möglichst lazy arbeiten, ohne unnötig große
Thunks aufzubauen.
Nutzen Sie den vorgegebenen Code von der Webseite, um ihre
Implementierung zu testen.
</p>

<p>
<b>Lösung:</b> siehe intify.hs
</p>
</div>
</div>

<div id="outline-container-orga928023" class="outline-2">
<h2 id="orga928023"><span class="section-number-2">6</span> Aufgabe 6 (TCP, Exercise 5.2)</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Implement a <code>Monad</code> instance for the list constructor, <code>[]</code>. Follow the types!</li>
</ol>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Monad</span> <span style="color: #2aa198;">[]</span> <span style="color: #859900; font-weight: bold;">where</span>
  return x <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[</span>x<span style="color: #2aa198;">]</span>
  <span style="color: #2aa198;">(</span><span style="color: #268bd2;">&gt;&gt;=</span><span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> flip concatMap
</pre>
</div>

<ol class="org-ol">
<li>Implement a <code>Monad</code> instance for <code>((-&gt;) e)</code>.</li>
</ol>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Monad</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #b58900;">-&gt;</span><span style="color: #b58900;">)</span> e<span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  return  <span style="color: #268bd2;">=</span> const
  f <span style="color: #268bd2;">&gt;&gt;=</span> k <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span>e <span style="color: #268bd2;">-&gt;</span> k <span style="color: #2aa198;">(</span>f e<span style="color: #2aa198;">)</span> e
</pre>
</div>

<ol class="org-ol">
<li>Implement <code>Functor</code> and <code>Monad</code> instances for <code>Free f</code>. Assume that <code>f</code> has a <code>Functor</code> instance.</li>
</ol>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">data</span> <span style="color: #b58900;">Free</span> f a <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Var</span> a <span style="color: #268bd2;">|</span> <span style="color: #b58900;">Node</span> <span style="color: #2aa198;">(</span>f <span style="color: #b58900;">(</span><span style="color: #b58900;">Free</span> f a<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Functor</span> f <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Functor</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Free</span> f<span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  fmap &#966; <span style="color: #2aa198;">(</span><span style="color: #b58900;">Var</span> a<span style="color: #2aa198;">)</span>  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Var</span> <span style="color: #268bd2;">$</span> &#966; a
  fmap &#966; <span style="color: #2aa198;">(</span><span style="color: #b58900;">Node</span> x<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Node</span> <span style="color: #268bd2;">$</span> fmap &#966; x

<span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Functor</span> f <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Monad</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Free</span> f<span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  return <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Var</span>
  <span style="color: #2aa198;">(</span><span style="color: #b58900;">Var</span> a<span style="color: #2aa198;">)</span>  <span style="color: #268bd2;">&gt;&gt;=</span> &#966; <span style="color: #268bd2;">=</span> &#966; a
  <span style="color: #2aa198;">(</span><span style="color: #b58900;">Node</span> x<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">&gt;&gt;=</span> &#966; <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Node</span> <span style="color: #268bd2;">$</span> fmap <span style="color: #2aa198;">(</span><span style="color: #268bd2;">&gt;&gt;=</span> &#966;<span style="color: #2aa198;">)</span> x
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb89dbd7" class="outline-2">
<h2 id="orgb89dbd7"><span class="section-number-2">7</span> Aufgabe 7 (TCP, Exercise 5.3)</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Implement <code>(&gt;&gt;=)</code> in terms of <code>fmap</code> (or <code>liftM</code>) and <code>join</code>.</li>
</ol>
<div class="org-src-container">
<pre class="src src-haskell">x <span style="color: #268bd2;">&gt;&gt;=</span> &#966; <span style="color: #268bd2;">=</span> join <span style="color: #268bd2;">$</span> fmap &#966; x
</pre>
</div>

<ol class="org-ol">
<li>Now implement <code>join</code> and <code>fmap</code> (or <code>liftM</code>) in terms of <code>(&gt;&gt;=)</code> and <code>return</code>.</li>
</ol>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">join</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Monad</span> m <span style="color: #268bd2;">=&gt;</span> m <span style="color: #2aa198;">(</span>m a<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> m a
<span style="color: #268bd2;">join</span> <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">&gt;&gt;=</span> id<span style="color: #2aa198;">)</span>

<span style="color: #268bd2;">fmap</span> f <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">&gt;&gt;=</span> return <span style="color: #268bd2;">.</span> f<span style="color: #2aa198;">)</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-orga700d58" class="outline-2">
<h2 id="orga700d58"><span class="section-number-2">8</span> Leseauftrag</h2>
<div class="outline-text-2" id="text-8">
<dl class="org-dl">
<dt>Literatur</dt><dd>[RWH, Kap. 25], [LYaH12, Kap. 6], [PHfNLP15, FS IV–V], [PSLIP]</dd>
</dl>
</div>
</div>

<div id="outline-container-org5dfbac4" class="outline-2">
<h2 id="org5dfbac4"><span class="section-number-2">9</span> Literatur</h2>
<div class="outline-text-2" id="text-9">
<dl class="org-dl">
<dt>[LYaH12]</dt><dd>Miran Lipovača: Learn You a Haskell for Great Good, 2012, <a href="http://learnyouahaskell.com/">http://learnyouahaskell.com/</a>.</dd>
<dt>[PHfNLP15]</dt><dd>Toni Dietze: Praktikum Haskell für NLP, Foliensatz, 2015.</dd>
<dt>[RWH08]</dt><dd>Bryan O'Sullivan, John Goerzen, and Don Stewart: Real World Haskell, 2008, <a href="http://book.realworldhaskell.org/">http://book.realworldhaskell.org/</a>.</dd>
<dt>[PSLIP]</dt><dd>Neil Mitchell: Plugging Space Leaks, Improving Performance, 2016, <a href="http://ndmitchell.com/downloads/slides-plugging_space_leaks_improving_performance-06_oct_2016.pdf">http://ndmitchell.com/downloads/slides-plugging_space_leaks_improving_performance-06_oct_2016.pdf</a>.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-17 Mi 07:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
